## 📋 Terraform Plan

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_pages_project.blog will be created
  + resource "cloudflare_pages_project" "blog" {
      + account_id        = "05369a2fbc916746c4db26dd2cfa3b4f"
      + created_on        = (known after apply)
      + domains           = (known after apply)
      + id                = (known after apply)
      + name              = "blog"
      + production_branch = "main"
      + subdomain         = (known after apply)

      + build_config {
          + build_command   = "npm run build"
          + destination_dir = "out"
          + root_dir        = "public/articles"
        }

      + source {
          + type = "github"

          + config {
              + deployments_enabled           = true
              + owner                         = "RYOTA-KOBA"
              + pr_comments_enabled           = true
              + preview_branch_excludes       = (known after apply)
              + preview_branch_includes       = [
                  + "develop",
                ]
              + preview_deployment_setting    = "all"
              + production_branch             = "main"
              + production_deployment_enabled = true
              + repo_name                     = "blog"
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cloudflare_pages_project_name = "blog"
  + cloudflare_pages_project_url  = (known after apply)

```

⚠️ **Please review the plan above before merging**